using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
 * Используя Visual Studio, создайте проект по шаблону Console Application. 
 * Создайте программу в которой создайте класс «Банковский Счет». 
 * В теле класса создайте следующие поля: дата открытия счета, процентная ставка по счету, 
 * сумма счета. В теле метода создайте следующие методы: Метод, который рассчитывает 
 * количество дней, начиная с даты открытия счета; Метод который выводит информацию о 
 * количестве рассчитанных дней; Метод который рассчитывает сумму, которая будет на счете 
 * через определенное количество лет (количество лет – параметр метода); Метод который 
 * выводит информацию о сумме. Также продумать над конструктором класса. В методе Main() 
 * создайте экземпляр класса «Банковский Счет», присвойте всем полям значение через свойства 
 * доступа, а также на экземпляр класса вызовите методы для отображения количества дней и суммы.
 */
namespace Task3
{
    internal class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
